let data = [{
	id: 0,
	title: "车站 (Live) - 李健",
	lrc: "车窗外恋人相拥,还在难舍难离,汽笛声突然响起,那姑娘满眼焦急,不觉中下起雨来,在黄昏的站台,她终于上了列车,却一直望向窗外,当列车徐徐开动掠过蓝色站牌,我看见她难过的脸,如此苍白,伴随雨点敲击车窗她的泪流下来,我赶紧转过头去让我视线离开,不知是听你的伤感还是无奈,天色暗了下来,人们开始了等待,我想起多年以前,像今天的画面,以为告别还会再见,哪知道一去不还,列车要奔向何方,我竟一丝慌张,夜色中车厢静悄悄,那姑娘已经睡着,当列车飞奔下一站的爱恨离别,我仿佛看见车窗外换了季节,在这一瞬间忘了要去向哪里的深夜,我不知道我还有多少相聚分别,就像这列车也不能随意停歇,匆匆掠过的不仅仅是窗外的世界,当列车飞奔下一站的爱恨离别,我仿佛看见车窗外换了季节,在这一瞬间忘了要去向哪里的深夜,我不知道我还有多少相聚分别,就像这列车也不能随意停歇,匆匆错过的何止是窗外的世界,啦啦啦...,啦啦啦... ",
	src: "http://www.ytmp3.cn/down/33359.mp3"
}, {
	id: 1,
	title: "John Williams - Romance for Guitar and String Orchestra",
	lrc: "纯音乐，请您欣赏",
	src: "music/John Williams - Romance for Guitar and String Orchestra.mp3"
}, {
	id: 2,
	title: "李健-贝加尔湖畔",
	lrc: "在我的怀里，在你的眼里，那里春风沉醉，那里绿草如茵，月光把爱恋，洒满了湖面，两个人的篝火，照亮整个夜晚，多少年以后，如云般游走，那变换的脚步，让我们难牵手，这一生一世，有多少你我，被吞没在月光如水的夜里，多想某一天，往日又重现，我们流连忘返，在贝加尔湖畔，多少年以后，往事随云走，那纷飞的冰雪容不下那温柔，这一生一世，这时间太少，不够证明融化冰雪的深情，就在某一天，你忽然出现，你清澈又神秘，在贝加尔湖畔，你清澈又神秘，像贝加尔湖畔",
	src: "music/李健-贝加尔湖畔.flac"
}, {
	id: 3,
	title: "The last waltz - Claude Piaf",
	lrc: "纯音乐，请您欣赏",
	src: "music/The last waltz - Claude Piaf.mp3"
}];

